-- MySQL dump 10.13  Distrib 8.0.40, for Win64 (x86_64)
--
-- Host: localhost    Database: shopping_mall
-- ------------------------------------------------------
-- Server version	8.4.3

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `customers`
--

DROP TABLE IF EXISTS `customers`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `customers` (
  `customer_id` int NOT NULL AUTO_INCREMENT,
  `username` varchar(50) NOT NULL,
  `email` varchar(100) NOT NULL,
  `phone` varchar(20) NOT NULL,
  `name` varchar(100) NOT NULL,
  `password` varchar(255) NOT NULL,
  `address` varchar(255) NOT NULL DEFAULT '',
  `detail_address` varchar(250) NOT NULL DEFAULT '',
  `zipcode` varchar(20) NOT NULL,
  `additional_address` varchar(255) DEFAULT NULL,
  `birth_date` date DEFAULT NULL,
  `status` json DEFAULT NULL,
  `gender` json DEFAULT NULL,
  `membership_level` enum('Bronze','Silver','Gold','Platinum') DEFAULT 'Bronze',
  `loyalty_points` int DEFAULT '0',
  `last_login` datetime DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`customer_id`),
  UNIQUE KEY `username` (`username`),
  UNIQUE KEY `email` (`email`)
) ENGINE=InnoDB AUTO_INCREMENT=44 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `customers`
--

LOCK TABLES `customers` WRITE;
/*!40000 ALTER TABLE `customers` DISABLE KEYS */;
INSERT INTO `customers` VALUES (1,'dxzf76','dxzf76@naver.com','010-4392-1342','임영수','inrqeqs4','울산광역시 은평구 청담로 29길 32','163호','64546','경기도 성남시 분당구 판교역로 146','1979-07-23','[\"Active\"]','[\"Male\"]','Bronze',231,'2025-11-22 13:19:20','2025-03-13 06:57:41','2025-03-13 06:57:41'),(2,'myw020','myw020@gmail.com','010-2652-9186','강지호','qymovk4d','인천광역시 노원구 올림픽대로 5길 31','1463호','88057','경상북도 포항시 남구 해동로 127','1998-08-22','[\"Active\"]','[\"Male\"]','Silver',175,'2025-06-25 02:59:01','2025-03-13 06:57:41','2025-03-13 06:57:41'),(3,'2sn116','2sn116@naver.com','010-6724-2669','윤민윤','qh53g3j7','대구광역시 노원구 올림픽대로 60길 40','1177호','48963','부산광역시 해운대구 센텀중앙로 90','2000-12-27','[\"Active\"]','[\"Male\"]','Bronze',788,'2025-02-19 03:13:01','2025-03-13 06:57:41','2025-03-13 06:57:41'),(4,'utr182','utr182@daum.net','010-4664-2308','장지혁','23n3wz7y','대구광역시 노원구 압구정로 79길 9','1427호','27567','전라북도 전주시 완산구 효자동3가 813','1983-06-20','[\"Active\"]','[\"Female\"]','Platinum',69,'2025-09-09 10:30:13','2025-03-13 06:57:41','2025-03-13 06:57:41'),(5,'h26i64','h26i64@daum.net','010-7445-8764','장서진','c9bwyd8y','광주광역시 노원구 신촌로 46길 33','1783호','79796','울산광역시 남구 삼산중로 84','1979-03-24','[\"Active\"]','[\"Male\"]','Silver',889,'2025-01-05 16:16:37','2025-03-13 06:57:41','2025-03-13 06:57:41'),(6,'ae5f15','ae5f15@gmail.com','010-1218-9106','최지진','7ldq83nv','인천광역시 노원구 올림픽대로 13길 31','454호','77450','인천광역시 연수구 컨벤시아대로 270','1975-05-13','[\"Active\"]','[\"Male\"]','Platinum',534,'2025-10-05 10:59:05','2025-03-13 06:57:41','2025-03-13 06:57:41'),(7,'pxst87','pxst87@daum.net','010-3255-9306','김석진','ur7s96kq','대구광역시 성북구 올림픽대로 53길 7','1864호','61354','경기도 성남시 분당구 판교역로 146','1980-10-12','[\"Active\"]','[\"Female\"]','Platinum',762,'2025-10-01 13:17:52','2025-03-13 06:57:41','2025-03-13 06:57:41'),(8,'p3ib33','p3ib33@gmail.com','010-9881-6201','최경희','ksz6icl8','부산광역시 노원구 압구정로 100길 2','475호','12919','전라북도 전주시 완산구 효자동3가 813','1991-09-06','[\"Active\"]','[\"Male\"]','Bronze',442,'2025-11-14 07:44:36','2025-03-13 06:57:41','2025-03-13 06:57:41'),(9,'w2yr48','w2yr48@naver.com','010-8989-4366','정훈아','d95wn2jh','인천광역시 서초구 종로 39길 14','1576호','21728','충청남도 천안시 서북구 불당대로 203','2000-02-07','[\"Active\"]','[\"Female\"]','Platinum',548,'2025-11-05 10:08:57','2025-03-13 06:57:41','2025-03-13 06:57:41'),(10,'9ltt74','9ltt74@naver.com','010-4874-3961','조민호','jigopjyu','대전광역시 종로구 충무로 15길 32','779호','83945','전라남도 여수시 여문로 120','1979-03-22','[\"Active\"]','[\"Male\"]','Platinum',472,'2025-02-12 01:39:34','2025-03-13 06:57:41','2025-03-13 06:57:41'),(11,'77yn67','77yn67@naver.com','010-7628-1554','윤현희','p6xe5nok','대구광역시 서초구 청담로 91길 34','324호','45454','충청남도 천안시 서북구 불당대로 203','1970-04-26','[\"Active\"]','[\"Female\"]','Platinum',362,'2025-11-03 06:42:05','2025-03-13 06:57:41','2025-03-13 06:57:41'),(12,'wmi798','wmi798@naver.com','010-8060-6210','조훈윤','uuodjrfr','울산광역시 송파구 종로 51길 9','1494호','70779','제주특별자치도 제주시 연동 276-1','1995-10-11','[\"Active\"]','[\"Male\"]','Silver',813,'2025-12-06 02:27:51','2025-03-13 06:57:41','2025-03-13 06:57:41'),(13,'sb8638','sb8638@naver.com','010-4882-3828','조석윤','3vxdz2bc','부산광역시 성북구 청담로 52길 23','651호','22440','충청남도 천안시 서북구 불당대로 203','1984-09-23','[\"Active\"]','[\"Male\"]','Bronze',611,'2025-04-01 21:28:12','2025-03-13 06:57:41','2025-03-13 06:57:41'),(14,'vzid12','vzid12@gmail.com','010-2302-3831','장서희','krxa9gt4','대전광역시 동작구 한강대로 77길 1','1127호','35779','경기도 수원시 영통구 삼성로 129','1995-11-16','[\"Active\"]','[\"Female\"]','Silver',379,'2025-02-09 11:17:35','2025-03-13 06:57:41','2025-03-13 06:57:41'),(15,'defm80','defm80@daum.net','010-8801-6921','정서호','7xzutmyn','대전광역시 성북구 한강대로 74길 34','1216호','70567','충청남도 천안시 서북구 불당대로 203','1971-06-24','[\"Active\"]','[\"Female\"]','Bronze',753,'2025-10-17 10:44:15','2025-03-13 06:57:41','2025-03-13 06:57:41'),(16,'wmfb89','wmfb89@naver.com','010-7524-3398','임경희','gjhm3u2m','인천광역시 종로구 종로 61길 25','1284호','35357','광주광역시 서구 상무중앙로 7','1989-10-21','[\"Active\"]','[\"Male\"]','Bronze',438,'2025-12-16 23:53:01','2025-03-13 06:57:41','2025-03-13 06:57:41'),(17,'dbkk52','dbkk52123@naver.com','010-6766-6993','조우윤11','rv4wqhe512','서울 성북구 개운사길 2','931호','02842','101호','1999-10-24','[\"Active\"]','[\"Male\"]','Silver',566,'2025-05-16 05:07:37','2025-03-13 06:57:41','2025-03-14 02:35:39'),(18,'ysy289','ysy289@naver.com','010-3532-6062','최우희','wehyyc3n','울산광역시 강남구 한강대로 21길 20','923호','72460','충청북도 청주시 상당구 상당로 45','1997-04-18','[\"Active\"]','[\"Male\"]','Platinum',180,'2025-08-12 19:46:40','2025-03-13 06:57:41','2025-03-13 06:57:41'),(19,'ivin51','ivin51@naver.com','010-4711-2642','박경빈','g0z08k22','인천광역시 송파구 테헤란로 45길 23','946호','34364','경상북도 포항시 남구 해동로 127','2004-02-25','[\"Active\"]','[\"Male\"]','Bronze',224,'2025-09-14 22:01:35','2025-03-13 06:57:41','2025-03-13 06:57:41'),(20,'6coz23','6coz23@gmail.com','010-3282-6258','강훈호','s6poisco','대구광역시 강남구 압구정로 61길 21','1523호','83549','경기도 성남시 분당구 판교역로 146','1972-05-03','[\"Active\"]','[\"Female\"]','Platinum',779,'2025-05-10 17:38:49','2025-03-13 06:57:41','2025-03-13 06:57:41'),(21,'ypti82','ypti82@naver.com','010-3846-2681','이서혁','5ogmofom','대전광역시 성북구 압구정로 22길 43','1219호','64235','대전광역시 유성구 엑스포로 123','1973-07-27','[\"Active\"]','[\"Female\"]','Bronze',234,'2025-05-09 06:23:36','2025-03-13 06:57:41','2025-03-13 06:57:41'),(22,'7xep37','7xep37@naver.com','010-3971-8286','임민수','r39nh9me','인천광역시 중구 홍대로 87길 27','154호','82314','경기도 성남시 분당구 판교역로 146','1979-09-19','[\"Active\"]','[\"Male\"]','Bronze',625,'2025-03-07 16:16:15','2025-03-13 06:57:41','2025-03-13 06:57:41'),(23,'800i83','800i83@daum.net','010-8011-5193','임석희','dkwg7ahz','대전광역시 동작구 충무로 1길 49','852호','47603','전라북도 전주시 완산구 효자동3가 813','1994-10-16','[\"Active\"]','[\"Male\"]','Platinum',429,'2025-01-12 13:30:23','2025-03-13 06:57:41','2025-03-13 06:57:41'),(24,'g5tl07','g5tl07@gmail.com','010-7596-6947','임훈준','i8nai077','서울특별시 강남구 충무로 34길 7','687호','20220','서울특별시 강남구 삼성로 102','1989-07-03','[\"Active\"]','[\"Male\"]','Platinum',354,'2025-10-05 17:08:56','2025-03-13 06:57:41','2025-03-13 06:57:41'),(25,'tbxc49','tbxc49@naver.com','010-4989-8470','장영진','hjjl16su','부산광역시 성북구 충무로 51길 48','1734호','84361','충청북도 청주시 상당구 상당로 45','1989-09-02','[\"Active\"]','[\"Female\"]','Silver',766,'2025-01-13 23:40:24','2025-03-13 06:57:41','2025-03-13 06:57:41'),(26,'tdux92','tdux92@gmail.com','010-3498-7790','박현호','3p8ve5p2','대구광역시 노원구 종로 95길 37','141호','34825','전라북도 전주시 완산구 효자동3가 813','1996-04-13','[\"Active\"]','[\"Male\"]','Silver',776,'2025-04-11 14:22:54','2025-03-13 06:57:41','2025-03-13 06:57:41'),(27,'8izw99','8izw99@naver.com','010-8596-6719','윤영희','0jjqxxju','광주광역시 송파구 종로 89길 25','1131호','36954','인천광역시 연수구 컨벤시아대로 270','2002-11-13','[\"Active\"]','[\"Female\"]','Platinum',118,'2025-05-11 16:17:47','2025-03-13 06:57:41','2025-03-13 06:57:41'),(28,'snxb71','snxb71@gmail.com','010-3914-9935','박경진','71lfw943','부산광역시 중구 홍대로 57길 22','142호','21629','서울특별시 강남구 삼성로 102','1993-05-11','[\"Active\"]','[\"Male\"]','Gold',538,'2025-01-03 22:01:54','2025-03-13 06:57:41','2025-03-13 06:57:41'),(29,'9k7q44','9k7q44@daum.net','010-7573-3115','임영연','2p9znye2','대전광역시 마포구 올림픽대로 61길 41','280호','63860','광주광역시 서구 상무중앙로 7','1981-11-24','[\"Active\"]','[\"Female\"]','Platinum',524,'2025-05-07 01:20:30','2025-03-13 06:57:41','2025-03-13 06:57:41'),(30,'kuap04','kuap04@naver.com','010-9243-3387','조민준','iruwwezw','광주광역시 강남구 올림픽대로 55길 12','549호','66360','전라북도 전주시 완산구 효자동3가 813','2003-03-13','[\"Active\"]','[\"Female\"]','Bronze',915,'2025-02-03 03:00:19','2025-03-13 06:57:41','2025-03-13 06:57:41'),(31,'xcpr65','xcpr65@naver.com','010-8053-3809','김지혁','xo3v115h','인천광역시 강남구 종로 33길 42','868호','20633','서울특별시 강남구 삼성로 102','2003-10-12','[\"Active\"]','[\"Male\"]','Bronze',995,'2025-04-06 15:31:14','2025-03-13 06:57:41','2025-03-13 06:57:41'),(32,'vxzf57','vxzf57@daum.net','010-5929-8978','최훈아','yc7uygjq','대전광역시 종로구 강남대로 87길 46','1063호','53130','경기도 성남시 분당구 판교역로 146','1989-01-08','[\"Active\"]','[\"Female\"]','Platinum',688,'2025-04-08 14:49:52','2025-03-13 06:57:41','2025-03-13 06:57:41'),(33,'dacv10','dacv10@daum.net','010-9652-8131','조현호','0o3x1lzn','광주광역시 은평구 테헤란로 43길 11','36호','67382','인천광역시 연수구 컨벤시아대로 270','1976-10-01','[\"Active\"]','[\"Female\"]','Bronze',651,'2025-12-14 15:44:54','2025-03-13 06:57:41','2025-03-13 06:57:41'),(34,'mjg717','mjg717@gmail.com','010-2323-7998','김서희','jd9xgaaf','부산광역시 은평구 올림픽대로 49길 3','35호','95602','충청남도 천안시 서북구 불당대로 203','1992-10-01','[\"Active\"]','[\"Male\"]','Silver',37,'2025-11-01 05:52:04','2025-03-13 06:57:41','2025-03-13 06:57:41'),(35,'1uwv78','1uwv78@daum.net','010-2291-8767','윤민희','xxmknf7g','부산광역시 종로구 한강대로 65길 30','1191호','34797','경상북도 포항시 남구 해동로 127','2003-10-13','[\"Active\"]','[\"Male\"]','Silver',239,'2025-12-20 21:29:25','2025-03-13 06:57:41','2025-03-13 06:57:41'),(36,'aown00','aown00@naver.com','010-9231-8840','김진희','b3e2zzb8','대구광역시 동작구 종로 53길 30','1352호','75641','경상남도 창원시 성산구 중앙대로 43','2004-10-22','[\"Active\"]','[\"Female\"]','Platinum',71,'2025-08-22 00:28:21','2025-03-13 06:57:41','2025-03-13 06:57:41'),(37,'y25v31','y25v31@naver.com','010-4426-7113','임진준','dv2hj35m','인천광역시 종로구 신촌로 27길 46','1676호','63805','경기도 성남시 분당구 판교역로 146','2002-04-24','[\"Active\"]','[\"Female\"]','Silver',327,'2025-05-23 21:48:29','2025-03-13 06:57:41','2025-03-13 06:57:41'),(38,'zswm42','zswm42@gmail.com','010-2611-8143','정우윤','xfscogmx','대전광역시 종로구 종로 56길 25','194호','90580','전라북도 전주시 완산구 효자동3가 813','1974-10-03','[\"Active\"]','[\"Male\"]','Gold',704,'2025-07-15 09:52:23','2025-03-13 06:57:41','2025-03-13 06:57:41'),(39,'ct1m50','ct1m50@naver.com','010-9224-3380','박지준','359j0z46','인천광역시 송파구 테헤란로 91길 13','1650호','80175','부산광역시 해운대구 센텀중앙로 90','1992-01-18','[\"Active\"]','[\"Male\"]','Platinum',935,'2025-04-20 17:03:32','2025-03-13 06:57:41','2025-03-13 06:57:41'),(40,'dgkl38','dgkl38@naver.com','010-2254-1385','정현준','e0rwk9k5','울산광역시 동작구 홍대로 12길 21','727호','96252','경기도 성남시 분당구 판교역로 146','1984-02-01','[\"Active\"]','[\"Male\"]','Bronze',769,'2025-12-12 18:11:58','2025-03-13 06:57:41','2025-03-13 06:57:41'),(41,'qwerqwer12','oks321098@gmail.com','010-9039-1273','오광석','qwerqwerqwer','서울 동작구 동작대로3길 50','104호','07015',NULL,NULL,NULL,NULL,'Bronze',0,NULL,'2025-03-13 07:24:31','2025-03-13 07:24:31'),(42,'test11','test11@naver.com','010-4455-6622','테스트','qwerqwerqwer','대구 군위군 군위읍 개봉길 23-72','테스트아파트 101호','43109',NULL,NULL,NULL,NULL,'Bronze',0,NULL,'2025-03-14 04:28:15','2025-03-14 04:28:15'),(43,'asdf123','hyunwoo@naver.com','010-1234-4567','김현우','qwerqwerqwer','서울 노원구 공릉로 264','현우아파트 202호','01810',NULL,NULL,NULL,NULL,'Bronze',0,NULL,'2025-03-14 06:13:31','2025-03-14 06:13:31');
/*!40000 ALTER TABLE `customers` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2025-03-17 10:58:50
